app/controllers/microposts_controller.rb

  def index
      @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Nhap cang"], ["content", "nhap cang"], ["user_id", 1], ["created_at", "2019-05-16 06:47:18.415835"], ["updated_at", "2019-05-16 06:47:18.415835"]]

  def update
    respond_to do |format|
      if @micropost.update(micropost_params)
---
UPDATE "microposts" SET "name" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["name", "ashdfhasdhfjahsdjfhjahsdjfhjashjdfhkasfHoang"], ["updated_at", "2019-05-16 06:05:34.271623"], ["id", 1]]

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]