app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)